app/views/users/allergies.html.erb

SELECT "allergy_items".* FROM "allergy_items"
---
        <div class="space-y-2 mt-2">
          <%= f.collection_check_boxes :allergy_item_ids, AllergyItem.all, :id, :name do |b| %>